Revit 2027 API
Rebar.LayoutRule Property
 Identifies the layout rule of rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarLayoutRule LayoutRule { get; }
Public ReadOnly Property LayoutRule As RebarLayoutRule
	Get
public:
property RebarLayoutRule LayoutRule {
	RebarLayoutRule get ();
}
member LayoutRule : RebarLayoutRule with get
Property Value
RebarLayoutRule
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace